app/views/participations/_form.html.erb

    <%= f.label :user_id %>
    <%= f.select :user_id, User.all.collect { |user| [ user.name, user.id ] }, { include_blank: true }, { required: true } %>
---
SELECT "users".* FROM "users"

    <%= f.label :choice_id %>
    <%= f.select :choice_id, Choice.all.collect { |choice| [ choice.value, choice.id ] }, { include_blank: true }, { required: true } %>
---
SELECT "choices".* FROM "choices"

    <%= f.label :bet_id %>
    <%= f.select :bet_id, Bet.all.collect { |bet| [ bet.name, bet.id ] }, { include_blank: true }, { required: true } %>
---
SELECT "bets".* FROM "bets"