app/views/participations/index.html.erb

SELECT  "choices".* FROM "choices" WHERE "choices"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
        <td><%= participation.user.name %></td>
        <td><%= participation.choice.value %></td>