app/views/choices/_form.html.erb

    <%= f.label :bet_id %>
    <%= f.select :bet_id, Bet.all.collect { |bet| [ bet.name, bet.id ] }, { include_blank: true }, { required: true } %>
---
SELECT "bets".* FROM "bets"