app/views/bets/index.html.erb

<div class="bet_list">
  <% @bets.bettable(current_user).sort_by {|bet| bet.deadline}[0 .. 9].each do |bet| %>
---
SELECT "bets".* FROM "bets"