app/controllers/bets_controller.rb

  def index
    @bets = Bet.all
---
SELECT "bets".* FROM "bets"

  def create
    params[:bet][:user_id] = current_user.id
    @bet = Bet.new(bet_params)

    respond_to do |format|
      if @bet.save
---
INSERT INTO "bets" ("name", "description", "deadline", "max_participants", "kind", "min_bet", "max_bet", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

  def destroy
    @bet.destroy
---
DELETE FROM "bets" WHERE "bets"."id" = $1  [["id", 1]]

    def set_bet
      @bet = Bet.find(params[:id])
---
SELECT  "bets".* FROM "bets" WHERE "bets"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]