app/controllers/choices_controller.rb

  def index
    @choices = Choice.all
---
SELECT "choices".* FROM "choices"

  def create
    @choice = Choice.new(choice_params)

    respond_to do |format|
      if @choice.save
---
INSERT INTO "choices" ("value", "created_at", "updated_at", "bet_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["value", "Gana caballo 1"], ["created_at", 2017-04-30 23:37:40 UTC], ["updated_at", 2017-04-30 23:37:40 UTC], ["bet_id", 1]]

  def destroy
    @choice.destroy
---
DELETE FROM "choices" WHERE "choices"."id" = $1  [["id", 3]]

    def set_choice
      @choice = Choice.find(params[:id])
---
SELECT  "choices".* FROM "choices" WHERE "choices"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]