app/controllers/participations_controller.rb

SELECT "participations".* FROM "participations"
---
  def index
    @participations = Participation.all

SELECT  "bets".* FROM "bets" WHERE "bets"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "participations" ("amount", "created_at", "updated_at", "user_id", "choice_id", "bet_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["amount", 110], ["created_at", 2017-04-30 23:45:03 UTC], ["updated_at", 2017-04-30 23:45:03 UTC], ["user_id", 1], ["choice_id", 1], ["bet_id", 1]]
---
  def create
    @bet = Bet.find(params[:bet_id])
    params[:participation][:user_id] = current_user.id
    @participation = @bet.participations.build(participation_params)

    respond_to do |format|
      if @participation.save

SELECT  "participations".* FROM "participations" WHERE "participations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_participation
      @participation = Participation.find(params[:id])