app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    if not is_admin
      @user[:role] = 'regular'
    end

    @user.balance = 10000

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "mail", "password", "role", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "aaaaa"], ["mail", "q@q.qa"], ["password", "aaaaaa"], ["role", "regular"], ["created_at", 2017-04-30 16:39:52 UTC], ["updated_at", 2017-04-30 16:39:52 UTC]]